{
  "title": { "eng": "Tools & skills", "pl": "narzędzia i umiejętności" },
  "button": { "eng": "more", "pl": "więcej" },
  "tools": [
    {
      "title": "Javascript",
      "short": {
        "eng": "I have renowned certificates confirming that I can develop web applications using JavaScript",
        "pl": "Posiadam certyfikaty OKE potwierdzające moją zdolność do tworzenia aplikacji internetowych z użyciem JavaScript"
      },
      "desc": {
        "eng": "I try to use the latest features that ES offers. I can explain how asynchronous JS works, I can write RegExp, manipulate DOM. I wrote an extension for chrome that optimizes my daily work.",
        "pl": "Napisałem wiele narzędzi i aplikacji web z użyciem JS. Staram się korzystać z najnowszych funkcji jakie oferuje ES. Potrafię wyjaśnić jak działa asynchroniczność w JS, pisać RegExp, manipulować DOM. Napisałem rozszerzenie do chrome optymalizujące moją codzienną pracę."
      }
    },
    {
      "title": "React.js",
      "short": {
        "eng": "On the frontend, I use React.js with its common libraries and tools such as RTKQuery and UI frameworks",
        "pl": "Na frontendzie używam React.js z typowymi dla niego biblioteczkami i narzędziami takimi jak RTKQuery czy frameworki UI"
      },
      "desc": {
        "eng": "I understand how React works, life cycle of a component, I can deal with routing, I try to use Memoization and also I can write Hooks and HoCs, integrate React apps with Api and what is more important, I know how to deal with errors and bugs.",
        "pl": "Rozumiem działanie React, cykl życia komponentu, potrafię zajmować się routingiem, staram się korzystać z Memoizacji a także potrafię pisać Hooki i HoC, integrować front Reacta z Api i co najważniejsze naprawiać błędy które występują po drodze. "
      }
    },
    {
      "title": "Node.js",
      "short": {
        "eng": "Created multiple Web-Apis, guiding the user from safe registration to fully usable web applications. ",
        "pl": "Potrafię tworzyć serwery Node, standalone jak i z Expressem"
      },
      "desc": {
        "eng": "I m capable of hosting Node servers in one cloud (cheap and with SSL :) ). I understand what asynchronicity is in Node, how to work with files, retrieve data from databases like Mongo or FirebaseRtdb, process it and return it. I can take a user from registration to logging out using Bcrypt or JWT tokens. I am familiar with Websockets and creating Rest APi. I am also capable of using Selenium",
        "pl": "Potrafię zahostować kilka serwerów Node w jednej chmurze (tanio i z SSL :)). Rozumiem czym jest asynchorniczność w Node, jak pracować z plikami, pobierać dane z baz danych takich jak Mongo czy FirebaseRtdb, przetwarzać je i zwracać. Potrafię przeprowadzić użytkownika od rejestracji po wylogowanie z użyciem Bcrypt czy tokenów JWT. Znam się na Websocketach i tworzeniu Rest APi. Posiadam także umiejętność posługiwania się Selenium"
      }
    },
    {
      "title": "Design",
      "short": {
        "eng": "On day basis utilizes Css with Sass. ",
        "pl": "Podczas stylowania używam css s preprocesorem Sass"
      },
      "desc": {
        "eng": "I believe I can turn any graphic design into a website using CSS. My skills include working with Sass, including using its variables. In addition, I am able to use selectors and create animations.",
        "pl": "Uważam że potrafię przekształcić dowolny projekt graficzny na stronę internetową wykorzystując CSS. Moje umiejętności obejmują pracę z Sass, w tym korzystanie z jego zmiennych. Ponadto, potrafię sięgać po różnorakie selektory i tworzyć animacje."
      }
    }
  ]
}
