{
	"title": {"eng":"Tools & skills","pl":"narzędzia i umiejętności"},
    "button":{"eng":"more","pl":"więcej"},
		"tools": [
			{
				"title":"React.js",
                "short":{
                    "eng":"The most important technologies I use in the field of Front is React.js. React's use of syntactic sugar amazed me. I wrote a couple websites in it, and explored MDN. I utilized the following technologies with React:  firebase, cloudinary, facebook SDk, bootstrap/material-UI."
                    ,"pl":"React jest biblioteką w której napisałem najwięcej stron. Rozumiem jego podstawy ale także i średnio-zaawansowane zagadnienia. Reacta używam w każdej ze swoich aplikacji webowych. "    
                },
                "desc":{
                    "eng":"default",
                    "pl":"default"
                }
			},
			{
				"title":"Next.js",
                "short":{
				"eng":"Next.js is tool which I choose over react since it made building apis simpler and improved how quickly images or subpages loaded. My most extensive application to date was a monopoly clone that I created in it. I tested express and mongodb after using Firebase and Recoil. Naturally, I also tested the rendering options provided by next, but I didn't make any applications for the audience."
            ,"pl":"W next.js tworzyłem aplikacje webowe, wybrałem go zaraz po reakcie, gdyż upraszczał on budowę api oraz optymalizował ładowanie zdjęć czy podstron. Zbudowałem w nim klona monopoly-moją dotychczas najbardziej rozbudowaną aplikację. Z nextem używałem: Firebase, recoil, testowałem też mongodb i express. Oczywiście rodzaje renderowania jakie oferuje next też przetestowałem, lecz nie stworzyłem żadnej aplikacji dla potwierdzenia."
			},  "desc":{
                "eng":"default",
                "pl":"default"
            }
        },
            {
				"title":"MERN",
                "short":{
				"eng":"Recently I started work in MERN stack, after working with Node and next.js so it was not so hard to grasp the groundings. I understand how middleware works and JWT. However, I feel that there still more to learn in there, and it will be learned in the future."		,
			"pl":"Z MERN stack zapoznałem się stosunkowo niedawno, podszedłem do niego z dobrą znajomością Node, oraz zaraz po Next.js więc załapanie architektury nie sprawiło mi problemów. Rozumiem jak działa warstwa middleware z expressem, JWT. Wiem że wszystkiego niewiem, ale z chęcią się dowiem."
            },  "desc":{
                "eng":"default",
                "pl":"default"
            }},{
				"title":"Node.js",
                "short":{
				"eng":"My adventure with Node.js began while rewriting one of my apps written in react (family tree). At the end, the application was in react, but the adventure with Node has only just begun. Later, Node.js served me long and pleasant hours spent on user simulation using pupetter or mineflayer."
            ,"pl":"Zacząłem z niego korzystać podczas przepisywania jednej ze swoich aplikacji napisanych w react (drzewo genealogiczne). Ostatecznie aplikacja została w react, ale przygoda z Node dopiero się zaczęła. Później Node.js to dla mnie długie i przyjemne godziny spędzone nad symulacją użytkownika z wykorzystaniem pupetter czy mineflayer. "		
			},  "desc":{
                "eng":"default",
                "pl":"default"
            }},{
                
				"title":"Additional",
                "short":{
				"eng":"I wrote few work optimalization scripts in python, one for resizing images in folder and automatically adding breakpoints to css. Now I'am waiting for Raspberry Pi Pico W in order to start some projects in  micro python utylizing python-api. Besides, I created rc car from scratch in arduino running on programmed atmega, soldered esc and nrf24l01 modules to it. This build required from me to get used to C-alike syntax and shown me practically how wireless data transfer works."
            ,"pl":"Dodatkowo napisałem kilka małych programów w Python, jeden z nich zmieniał rozmiar zdjęć i zapisywał breakpointy w css. Teraz oczekuję na Raspberry Pi Pico W aby zacząć projekty w python korzystające z api pythona. Dodatkowo stworzyłem zdalnie sterowany model od podstaw, programując mikrokontroler, lutując moduły komunikacji zdalnej. Ten projekt nauczył mnie składni podobnej do języka C oraz pokazał mi jak działają podzespoły w urządzeniach elektronicznych."
},  "desc":{
    "eng":"default",
    "pl":"default"
}}]
    }
